# Pandas
#### Series

In [ ]:

import pandas as pd

SyntaxError: invalid syntax (1884014104.py, line 1)

In [4]:
pip install pandas

Collecting pandas
  Downloading pandas-2.3.0-cp310-cp310-manylinux_2_17_x86_64.manylinux2014_x86_64.whl (12.3 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 12.3/12.3 MB 23.7 MB/s eta 0:00:0000:0100:01
Requirement already satisfied: python-dateutil>=2.8.2 in ./newvirtual/lib/python3.10/site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1
  Downloading pytz-2025.2-py2.py3-none-any.whl (509 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 509.2/509.2 KB 29.4 MB/s eta 0:00:00
Collecting tzdata>=2022.7
  Downloading tzdata-2025.2-py2.py3-none-any.whl (347 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 347.8/347.8 KB 17.3 MB/s eta 0:00:00
Requirement already satisfied: numpy>=1.22.4 in ./newvirtual/lib/python3.10/site-packages (from pandas) (2.2.6)
Requirement already satisfied: six>=1.5 in ./newvirtual/lib/python3.10/site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Installing collected packages: pytz, tzdata, pandas
Successfully installed pandas-2.3.0 pytz-2025.2 tzdata-2025.2
Note: you may need to restart the kernel to use updated packages.

In [9]:
import pandas as pd
a=pd.Series([1,2,3])
print (a)
type(a)

0    1
1    2
2    3
dtype: int64

pandas.core.series.Series

In [10]:
pd.Series(['a','b','c'])

0    a
1    b
2    c
dtype: object

In [13]:
a=pd.date_range(start='01-02-2020',end='05-03-2020')
a.shape
type(a)

pandas.core.indexes.datetimes.DatetimeIndex

### Data Frames

In [17]:
import numpy as np

temp=np.random.randint(low=20,high=100,size=20)
name=np.random.choice(["sakshi","ankit","aditya","udit","raja"],size=20)
rendom=np.random.choice([10,20,13,23,91],size=20)
data=list(zip(temp,name,rendom))
data

[(np.int64(62), np.str_('aditya'), np.int64(10)),
 (np.int64(86), np.str_('sakshi'), np.int64(10)),
 (np.int64(66), np.str_('sakshi'), np.int64(91)),
 (np.int64(28), np.str_('raja'), np.int64(20)),
 (np.int64(32), np.str_('ankit'), np.int64(20)),
 (np.int64(60), np.str_('udit'), np.int64(13)),
 (np.int64(79), np.str_('raja'), np.int64(20)),
 (np.int64(96), np.str_('sakshi'), np.int64(13)),
 (np.int64(60), np.str_('ankit'), np.int64(23)),
 (np.int64(53), np.str_('aditya'), np.int64(91)),
 (np.int64(60), np.str_('udit'), np.int64(23)),
 (np.int64(80), np.str_('aditya'), np.int64(20)),
 (np.int64(27), np.str_('sakshi'), np.int64(13)),
 (np.int64(34), np.str_('sakshi'), np.int64(20)),
 (np.int64(86), np.str_('sakshi'), np.int64(13)),
 (np.int64(38), np.str_('ankit'), np.int64(23)),
 (np.int64(66), np.str_('aditya'), np.int64(23)),
 (np.int64(85), np.str_('raja'), np.int64(23)),
 (np.int64(59), np.str_('sakshi'), np.int64(20)),
 (np.int64(74), np.str_('aditya'), np.int64(23))]

In [19]:
df=pd.DataFrame(data,columns=['temp','name','random'])
# type(df)
df

    temp    name  random
0     62  aditya      10
1     86  sakshi      10
2     66  sakshi      91
3     28    raja      20
4     32   ankit      20
5     60    udit      13
6     79    raja      20
7     96  sakshi      13
8     60   ankit      23
9     53  aditya      91
10    60    udit      23
11    80  aditya      20
12    27  sakshi      13
13    34  sakshi      20
14    86  sakshi      13
15    38   ankit      23
16    66  aditya      23
17    85    raja      23
18    59  sakshi      20
19    74  aditya      23

In [22]:
df.info()
df.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   temp    20 non-null     int64
 1   name    20 non-null     object
 2   random  20 non-null     int64
dtypes: int64(2), object(1)
memory usage: 608.0+ bytes

            temp    random
count  20.000000  20.00000
mean   61.550000  25.60000
std    20.982386  22.83211
min    27.000000  10.00000
25%    49.250000  13.00000
50%    61.000000  20.00000
75%    79.250000  23.00000
max    96.000000  91.00000

In [24]:
df['name']

0     aditya
1     sakshi
2     sakshi
3       raja
4      ankit
5       udit
6       raja
7     sakshi
8      ankit
9     aditya
10      udit
11    aditya
12    sakshi
13    sakshi
14    sakshi
15     ankit
16    aditya
17      raja
18    sakshi
19    aditya
Name: name, dtype: object

In [62]:
df.head()
df.tail()
# df.set_index('temp',inplace=True)
# df.sort_index(axis=0,ascending=True)
df.sort_values(by='name',axis=0,ascending=True)
groupby=df.groupby(by='name')
groupby.get_group('sakshi')
groupby.describe()

       random
        count       mean        std   min   25%   50%   75%   max
name
aditya    5.0  33.400000  32.638934  10.0  20.0  23.0  23.0  91.0
ankit     3.0  22.000000   1.732051  20.0  21.5  23.0  23.0  23.0
raja      3.0  21.000000   1.732051  20.0  20.0  20.0  21.5  23.0
sakshi    7.0  25.714286  29.038562  10.0  13.0  13.0  20.0  91.0
udit      2.0  18.000000   7.071068  13.0  15.5  18.0  20.5  23.0

In [63]:
# print(df)
df.iloc[[3,9,0]]
df.iloc[1:2,0:2]
# df.iloc[1,'name':'random']
df.loc[86,'name':'random']
df.loc[df.random==10]
type(df.random)

pandas.core.series.Series

### merging

In [66]:
df1=pd.DataFrame({"letter":['a','b','c'],"number":[1,2,3]})
df2=pd.DataFrame({"character":['a','b'],"number":[2,3],"name":['ab','bc']})

pd.concat([df1,df2],axis=0)
pd.concat([df1,df2],axis=1)

  letter  number character  number name
0      a       1         a     2.0   ab
1      b       2         b     3.0   bc
2      c       3       NaN     NaN  NaN

In [68]:
pd.merge(df1,df2,on='number',how='outer')

  letter  number character name
0      a       1       NaN  NaN
1      b       2         a   ab
2      c       3         b   bc

In [76]:
a=np.matrix([[1,2,3],[2,4,5],[5,6,7]])
a
b=np.matrix([[3],[4],[5]])
print(a.shape)
print(b.shape)
a*b

(3, 3)
(3, 1)

matrix([[26],
        [47],
        [74]])